cylinder_Re_0.25/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    cylinder
    {
        type            fixedValue;
        value           uniform (0 0 0);
        
    }

    "(bot|top)"
    {
        type            slip;
    }

     
    outlet
    {
        type            zeroGradient;    
        
    }
    
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);

    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
